#### TagMode Enumeration

---

|  |
| --- |
| See Also |

The modes of tag creation that are supported for IndependentTags.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TagMode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TagMode ``` |

| Visual C++ |
| --- |
| ``` public enum class TagMode ``` |

# Members

| Member name | Description |
| --- | --- |
| TM\_ADDBY\_CATEGORY | Add a single category tag. |
| TM\_ADDBY\_MULTICATEGORY | Add a multi-category tag. |
| TM\_ADDBY\_MATERIAL | Add a material tag. |

# See Also

Autodesk.Revit.DB Namespace